<template>
  <mu-container ref="container" class="container-width-control" style="text-align: left">
    <h2>关于本站</h2>
    <p>这是虚拟偶像企划<a href="https://space.bilibili.com/364225566">战斗吧歌姬</a>，在2019-2021年初所运营的微信小程序中，“战姬众”板块发帖的全部内容的备份镜像站。<b>目前仅支持贝拉板块的内容</b>，包含“歌姬说”的内容。</p>
    <p>本站的数据来源是上述小程序的论坛公开内容，数据爬取时间为2021-02-19~2020-02-21之间，总数据量约73GB。所有的数据均为战姬众板块的公开帖子数据，不含任何非公开的、付费的或敏感的数据内容；同时，在爬取数据时也对可能具有一定敏感性的数据（例如用户在小程序的UID、填写的性别等）进行了脱敏处理，关于用户信息的数据仅保留昵称、头像、头像框三项，除此之外不含任何关于用户的个人信息，请放心使用。</p>
    <p>本站仅是在小程序停止一切发帖功能之后，将所有的帖子数据备份下来，因此不提供进一步的发帖、回复、点赞等任何互动功能，也不支持修改昵称、头像、头像框等等。但是，如果战姬众不希望个人发帖的数据在这里被留存下来，本站支持战姬众可以申请将本人的所有帖子数据从本站上删除。不支持删除个别的指定帖子。具体的申请方式，请见下方“联系开发者”部分。</p>
    <h2>使用协议与免责声明(2020-02-24)</h2>
    <p><b>您使用本站，即视为知晓并同意以下所有的协议内容：</b></p>
    <p>网站的运营是需要成本的，尤其像小程序这种相对较大的数据量。网站的运营成本目前均由开发者自行承担，暂不（今后也并不打算）接受公开捐赠。</p>
    <p>出于大家的访问体验考虑，网站是挂在腾讯云的云对象存储和CDN(内容分发网络)上的，因此您的每一次访问所产生的数据流量都在产生费用。希望各位战姬众爱护和合理使用网站。<b>禁止对本站进行二次爬取、攻击、使用脚本等任何非常规使用的行为，也不得用于个人浏览之外的任何用途。</b></p>
    <p><b>网站开发者有权随时因为任何原因，包括但不限于访问流量过大、有人进行非正当使用行为、网站支出的费用过高等，在任何时刻不提前通知地停止网站服务，并不为网站服务停止所造成的任何组织或个人的任何损失承担任何责任。</b></p>
    <p>本网站不会用作任何商业用途，网站上的所有内容，包括但不限于所有帖子、文章、各种形式的二创，权利归相应的原作者所有。<b>严禁任何人对本网站上的内容进行盗取、盗用、用作商业用途等侵犯著作权的行为，严禁将内容用作任何违反法律法规的用途。若因此造成任何组织、个人的任何损失，由责任人自行承担，本网站不负任何责任。</b></p>
    <p>您同意，本网站开发者有权随时修改上述声明的内容，并不需要提前通知。</p>
    <p><b>如果您不同意上述的任何内容，请立即停止使用本网站。</b></p>
    <h2>设立初心</h2>
    <p>建立本站的初心是，小程序中有着两年来战姬众的喜怒哀乐、战姬众与歌姬和战姬众之间的互动交流，更有着数不清的优秀二创。官方决定在2020-04-30停止小程序服务器运营，意味着这些珍贵的回忆和作品就将全部灭失。因此，希望能够保留下这些帖子作为念想，无论企划今后走向何方，这都将是战姬众们与第一代歌姬们的最宝贵的回忆。</p>
    <h2>使用说明</h2>
    <p>点击左上角的文字可以回到首页。在首页可以浏览所有帖子。右上角的四个按钮，分别是：</p>
    <p>页面控制：可以快速跳转到指定的页码，避免需要不停下滑。</p>
    <p>跳转到时间：可以选择时间，快速将页面跳转到指定时间对应的页码。</p>
    <p>设置：可以调整浏览的信息，包括仅看二创、仅看歌姬等。</p>
    <h2>联系开发者</h2>
    <p>网站开发者：星露</p>
    <p>联系方式1（QQ）：在伊莎贝拉后援会（非官方群），或战斗吧歌姬粉丝应援团（总团）1群中搜索“星露”。出于隐私考虑，QQ号在此不公布，如果您不在上述的群里，请通过方式2进行联系。</p>
    <p>联系方式2（邮箱）：<a href=mailto:starrah@foxmail.com>starrah@foxmail.com</a></p>
    <p>如有任何意见建议，或希望删除本人的全部数据，请通过以上两个方式之一进行反馈。</p>
    <h2>未来开发计划（咕咕咕）</h2>
    <p>查看某个用户发过的全部帖子</p>
    <p>显示帖子的话题，和根据话题浏览帖子</p>
    <p>根据关键词，在帖子内部进行搜索</p>
    <h2>技术细节</h2>
    <p>网站基于Vue2构建，是全静态网站设计，除了之后可能检索功能不得不加少量的后端接口外，目前没有任何后端接口。</p>
    <p>进行这样的建构主要是希望网站能够独立的以文件的形式存在，不需要依赖于特定的后端，这样任何人只要获取了文件内容就可以整个构建出这个网站，不至于因为我个人的服务器失效导致整个网站都无法运作。</p>
    <p>帖子以JSON的形式进行组织和存储，前端在访问时根据要访问的帖子id直接请求特定的JSON获得帖子内容，并在前端进行相关运算后进行显示。</p>
    <p>帖子筛选（仅看二创、仅看歌姬等）、页面跳转、根据时间跳转功能，是通过预先使用脚本生成的索引表来完成的。前端获取索引表之后解析其中内容、以此为依据进行相关筛选和跳转。</p>
    <p><a href=""></a>前端源码通过Github开源，目前并没有可以帮助理解架构和开发的文档、也没有对JSON数据结构的说明。如果您有意参与本项目，可以先通过上面的联系方式和我联系。</p>
    <p>数据爬虫，出于防止被滥用的考虑，不进行开源，反正4月30日小程序就停服了、也用不上了。</p>
    <div style="margin: 32px; display: flex; justify-content: center">
      <mu-button color="primary" @click="jumpToMainPage">我已阅读以上所有内容，确认</mu-button>
    </div>
  </mu-container>
</template>

<script lang="ts">
import {Component, Vue} from "vue-property-decorator";

@Component
export default class About extends Vue {
  jumpToMainPage() {
    this.$router.push('/')
  }
}
</script>
